name: "ugcvqa_nr"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "input_video"
    data_type: TYPE_FP32
    dims: [ -1, 3, 448, 448 ]  # -1 cho num_frames để support dynamic
  }
]

output [
  {
    name: "quality_score" 
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]

dynamic_batching {
  preferred_batch_size: [ 1, 4, 8 ]
  max_queue_delay_microseconds: 100
}